{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "y= 11111110.212100\n"
     ]
    }
   ],
   "source": [
    "# Задание-1: уравнение прямой вида y = kx + b задано в виде строки.\n",
    "# Определить координату y точки с заданной координатой x.\n",
    "\n",
    "equation = 'y = -12x + 11111140.2121'\n",
    "x = 2.5\n",
    "# вычислите и выведите y\n",
    "s = equation.split('=')\n",
    "s1= s[1].split('x')\n",
    "\n",
    "kl= list(s1[0])\n",
    "while ' ' in kl:\n",
    "    kl.remove(' ')\n",
    "k = float(''.join(kl))\n",
    "\n",
    "bl= list(s1[1])\n",
    "while ' ' in bl:\n",
    "    bl.remove(' ')\n",
    "b = float(''.join(bl))\n",
    "so = 'y= %f' % (k*x + b)\n",
    "print(so)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "дата корректна\n"
     ]
    }
   ],
   "source": [
    "# Задание-2: Дата задана в виде строки формата 'dd.mm.yyyy'.\n",
    "# Проверить, корректно ли введена дата.\n",
    "# Условия корректности:\n",
    "# 1. День должен приводиться к целому числу в диапазоне от 1 до 30(31)\n",
    "#  (в зависимости от месяца, февраль не учитываем)\n",
    "# 2. Месяц должен приводиться к целому числу в диапазоне от 1 до 12\n",
    "# 3. Год должен приводиться к целому положительному числу в диапазоне от 1 до 9999\n",
    "# 4. Длина исходной строки для частей должна быть в соответствии с форматом \n",
    "#  (т.е. 2 символа для дня, 2 - для месяца, 4 - для года)\n",
    "\n",
    "# Пример корректной даты\n",
    "date = '01.11.1985'\n",
    "\n",
    "# Примеры некорректных дат\n",
    "#date = '01.22.1001'\n",
    "#date = '1.12.1001'\n",
    "#date = '-2.10.3001'\n",
    "\n",
    "d30=(2,4,6,9,11)\n",
    "s = date.split('.')\n",
    "verdict = 'дата корректна'\n",
    "if not(s[0].isdigit() and s[1].isdigit() and s[2].isdigit()): \n",
    "    verdict = 'дата некорректна - входят нецифры'\n",
    "else:\n",
    "    d,m,y = int(s[0]),int(s[1]),int(s[2])\n",
    "    if len(s[0]) != 2 or len(s[1]) != 2 or len(s[2]) != 4: \n",
    "        verdict = 'дата некорректна - по пункту 4'\n",
    "    if not(0    < y < 10000):\n",
    "        verdict = 'дата некорректна - по пункту 3'\n",
    "    if not( d>0 and ((d<=30 and m in d30) or (d==31 and m not in d30)) ):\n",
    "        verdict = 'дата некорректна - по пункту 1'\n",
    "    if not(0 < m < 13):\n",
    "        verdict = 'дата некорректна - по пункту 2'\n",
    "print(verdict)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "введи номер комнаты: 8796543\n",
      "44320 30\n"
     ]
    }
   ],
   "source": [
    "# Задание-3: \"Перевёрнутая башня\" (Задача олимпиадного уровня)\n",
    "#\n",
    "# Вавилонцы решили построить удивительную башню —\n",
    "# расширяющуюся к верху и содержащую бесконечное число этажей и комнат.\n",
    "# Она устроена следующим образом — на первом этаже одна комната,\n",
    "# затем идет два этажа, на каждом из которых по две комнаты, \n",
    "# затем идёт три этажа, на каждом из которых по три комнаты и так далее:\n",
    "#         ...\n",
    "#     12  13  14\n",
    "#     9   10  11\n",
    "#     6   7   8\n",
    "#       4   5\n",
    "#       2   3\n",
    "#         1\n",
    "#\n",
    "# Эту башню решили оборудовать лифтом --- и вот задача:\n",
    "# нужно научиться по номеру комнаты определять,\n",
    "# на каком этаже она находится и какая она по счету слева на этом этаже.\n",
    "#\n",
    "# Входные данные: В первой строчке задан номер комнаты N, 1 ≤ N ≤ 2 000 000 000.\n",
    "#\n",
    "# Выходные данные:  Два целых числа — номер этажа и порядковый номер слева на этаже.\n",
    "#\n",
    "# Пример:\n",
    "# Вход: 13\n",
    "# Выход: 6 2\n",
    "#\n",
    "# Вход: 11\n",
    "# Выход: 5 3\n",
    "inp = int(input('введи номер комнаты: '))\n",
    "nb = 1; n_room_last = 1; n_flr_last = 1 \n",
    "# найдем в каком блоке эта комната:\n",
    "while inp > n_room_last:\n",
    "    nb += 1; n_room_last += (nb*nb); n_flr_last += nb\n",
    "# сколько этажей блока над её этажом, соответственно её этаж:\n",
    "flr_on = (n_room_last-inp) // nb; out_1 = n_flr_last - flr_on\n",
    "# номер последнй квартиры на её этаже\n",
    "n_flr_room_last = n_room_last - flr_on*nb\n",
    "out_2 = nb - n_flr_room_last + inp\n",
    "print(out_1,out_2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
